---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCRange.Dispose
source: html/569a4a3b-d703-8cf5-27e3-24edd9a73afb.htm
---
# Autodesk.Revit.DB.IFC.IFCRange.Dispose Method

Releases all resources used by the IFCRange

## Syntax (C#)
```csharp
public void Dispose()
```